Repository: zipf/perldoc-es
Catalog: memory/_reference/padre-es_work.tmx
Source language: en_us
Languages: es_es

source: This type of file (URL) is missing delete support.
es_es: Este tipo de archivo (URL) no se puede eliminar.

source: Threads
es_es: Hilos de ejecución

source: Timeout (in seconds)
es_es: Tiempo de espera (en segundos)

source: To-do
es_es: Tareas pendientes

source: Today
es_es: Hoy

source: Toggle Diff window feature that compares two buffers graphically
es_es: Alterna la ventana de diferencias, que permite comparar dos búferes gráficamente

source: Toggle MetaCPAN CPAN explorer panel
es_es: Alterna el panel de explorador de MetaCPAN y CPAN

source: Toggle Perl 6 auto detection in Perl 5 files
es_es: Alterna la detección automática de Perl 6 en archivos de Perl 5

source: Toggle document differences feature
es_es: Alterna la detección de diferencias de documentos

source: Toggle syntax checker annotations in editor
es_es: Alterna las anotaciones del comprobador de sintaxis en el editor

source: Toggle version control system support
es_es: Alterna la disponibilidad de un sistema de control de versiones

source: Translation
es_es: Traducción

source: True
es_es: Verdadero

source: Turkish
es_es: Turco

source: Turn on CPAN explorer
es_es: Activa el Explorador de CPAN

source: Turn on Diff window
es_es: Activa la ventana de diferencias

source: Turn on syntax checking of the current document and show output in a window
es_es: Activa la comprobación de sintaxis para el documento actual y muestra los resultados en una ventana

source: Turn on version control view of the current project and show version control changes in a window
es_es: Activa la vista de control de versiones del proyecto actual y muestra los cambios de control de versiones en una ventana

source: Type
es_es: Tipo

source: Type a help &keyword to read:
es_es: &Palabra clave que desea buscar en la ayuda:

source: Type in any expression and evaluate it in the debugged process
es_es: Permite escribir una expresión y la evalúa en el proceso depurado

source: UNKNOWN
es_es: DESCONOCIDO

source: Un&fold All
es_es: &Desplegar todo

source: Unable to parse %s
es_es: No se puede analizar %s

source: Undo last change in current file
es_es: Deshace el último cambio realizado en el archivo actual

source: Unfold all the blocks that can be folded (need folding to be enabled)
es_es: Expande todos los bloques que se pueden plegar (el plegado debe estar habilitado)

source: Unicode character 'name'
es_es: 'Nombre' de carácter Unicode

source: Unknown
es_es: Desconocido

source: Unknown error
es_es: Error desconocido

source: Unknown error from
es_es: Error desconocido de

source: Unmodified
es_es: Sin modificar

source: Unsaved %d
es_es: %d (sin guardar)

source: Unsaved File
es_es: Archivo sin guardar

source: Unsupported OS: %s
es_es: SO incompatible: %s

source: Untitled
es_es: Sin título

source: Unversioned
es_es: Sin control de versiones

source: Up
es_es: Arriba

source: Updated but unmerged
es_es: Actualizado pero sin combinar

source: Upload
es_es: Cargar

source: Upper/Lo&wer Case
es_es: &Mayúsculas/Minúsculas

source: Uppercase characters
es_es: Caracteres en mayúsculas

source: Uppercase next character
es_es: Siguiente carácter en mayúscula

source: Uppercase till \E
es_es: Mayúsculas hasta \E

source: Use FTP passive mode
es_es: Usar el modo pasivo de FTP

source: Use Perl source as filter
es_es: Usa código fuente Perl como filtro

source: Use Tabs
es_es: Usar tabulaciones

source: Use X11 middle button paste style
es_es: Usar estilo de pegar con botón central de X11

source: Use a filter to select one or more files
es_es: Usar un filtro para seleccionar uno o varios archivos

source: Use external window for execution
es_es: Usar ventana externa para la ejecución

source: Use splash screen
es_es: Usar pantalla de bienvenida

source: User
es_es: Usuario

source: Username
es_es: Nombre de usuario

source: Using CPAN.pm to install a CPAN like package opened locally
es_es: Usa CPAN.pm para instalar un paquete preparado para CPAN abierto localmente

source: Using pip to download a tar.gz file and install it using CPAN.pm
es_es: Usa pip para descargar un archivo tar.gz e instalarlo con CPAN.pm

source: Value
es_es: Valor

source: Variable Name
es_es: Nombre de variable

source: Variable case change
es_es: Cambiar mayúsculas/minúsculas de variable

source: Version
es_es: Versión

source: Version Control
es_es: Control de versiones

source: Vertically &Align Selected
es_es: Alinear seleccionadas &verticalmente

source: Very Fatal Error
es_es: Error fatal grave

source: View
es_es: Ver

source: View All &Open Bugs
es_es: &Ver todos los errores abiertos

source: View all known and currently unsolved bugs in Padre
es_es: Muestra todos los errores conocidos y pendientes de Padre

source: Visible characters
es_es: Caracteres visibles

source: Visible characters and spaces
es_es: Caracteres visibles y espacios

source: Visit Perl Websites...
es_es: Visitar sitios web sobre Perl...

source: Visual filename %s does not match the internal filename %s, do you want to abort saving?
es_es: El nombre de archivo visible, %s, no coincide con el nombre de archivo interno, %s. ¿Desea cancelar la operación de almacenamiento?

source: Warning
es_es: Aviso

source: Warning!
es_es: Advertencia:

source: This will delete all the changes you made to 'My plug-in' and replace it with the default code that comes with your installation of Padre
es_es: Esto eliminará todos los cambios realizados en el complemento personalizado ("My") y los sustituirá por el código predeterminado incluido en la instalación de Padre

source: Warning: found SVN v%s but we require SVN v%s and it is now called "Apache Subversion"
es_es: Advertencia: se detectó SVN v%s per necesita SVN v%s, que ahora se llama "Apache Subversion"

source: We found several new plug-ins.
es_es: Se han detectado varios complementos nuevos.

source: In order to configure and enable them go to Plug-ins -> Plug-in Manager List of new plug-ins:
es_es: Para configurarlos y habilitarlos, vaya a Complementos -> Administrador de complementos Lista de complementos nuevos:

source: Web Files
es_es: Archivos web

source: Whatever
es_es: Cualquier cosa

source: When in a subroutine call show all the calls since the main of the program
es_es: Dentro de una subrutina, muestra todas las llamadas desde el programa principal

source: When typing in functions allow showing short examples of the function
es_es: Al escribir funciones, permite mostrar ejemplos breves de uso de la función

source: Where did you hear about Padre?
es_es: ¿Cómo descubrió Padre?

source: Whitespace characters
es_es: Caracteres de espacio en blanco

source: Window
es_es: Ventana

source: Window list
es_es: Lista de ventanas

source: Word count and other statistics of the current document
es_es: Recuento de palabras y otras estadísticas del documento actual

source: Words
es_es: Palabras

source: Wrap long lines
es_es: Ajusta las líneas largas

source: Writing file to FTP server...
es_es: Escribiendo archivo en el servidor FTP...

source: Wx::Perl::ProcessStream is version %s which is known to cause problems.
es_es: La versión %s de Wx::Perl::ProcessStream causa problemas.

source: Get at least 0.20 by typing cpan Wx::Perl::ProcessStream
es_es: Debe usar como mínimo la versión 0.20. Para ello, escriba cpan Wx::Perl::ProcessStream

source: Year
es_es: Año

source: You are going to write a file using HTTP PUT.
es_es: Va a escribir un archivo con HTTP PUT.

source: This is highly experimental and not supported by most servers.
es_es: Esta característica es muy experimental y no la admiten la mayoría de los servidores.

source: You must select a range of lines
es_es: Debe seleccionar un intervalo de líneas

source: You still have a running process.
es_es: Se está ejecutando un proceso.

source: Do you want to kill it and exit?
es_es: ¿Desea eliminarlo y salir?

source: cpanm is unexpectedly not installed
es_es: No se esperaba que cpanm no estuviera instalado

source: disabled
es_es: deshabilitado

source: e.g.
es_es: p. ej.

source: enabled
es_es: habilitado

source: fresh
es_es: recién instalado

source: loaded
es_es: cargado

source: no highlighter for mime-type '%s' using stc
es_es: no hay resaltador para mime-type '%s' con stc

source: none
es_es: ninguno

source: unloaded
es_es: descargado

source: wrap in grep { }
es_es: incluir en grep { }

source: wrap in map { }
es_es: incluir en map { }

source: wxPerl &Live Support
es_es: Soporte en &línea de wxPerl

source: %s has no constructor
es_es: %s no tiene un constructor

source: &Add
es_es: &Agregar

source: &Back
es_es: &Atrás

source: &Comment Selected Lines
es_es: &Marcar seleccionadas como comentario

source: &Full Screen
es_es: &Pantalla completa

source: &Insert
es_es: &Insertar

source: &Select to Matching Brace
es_es: &Seleccionar hasta llave de correspondiente

source: &Uncomment Selected Lines
es_es: &Quitar marca de comentario de seleccionadas

source: (Re)load Current Plug-in
es_es: Volver a cargar el complemento actual

source: About Padre
es_es: Acerca de Padre

source: Add another closing bracket if there is already one (and the 'Autocomplete brackets' above is enabled)
es_es: Agrega otra llave de cierre si ya hay una (y la función de cierre automático de llaves está habilitada)

source: An error has occured while generating '%s': %s
es_es: Error al generar '%s': %s

source: Any changes to these options require a restart:
es_es: La modificación de estas opciones requiere reiniciar:

source: Apache License
es_es: Licencia Apache

source: Apply Diff to File
es_es: Aplicar diferencias a archivo

source: Apply Diff to Project
es_es: Aplicar diferencias a proyecto

source: Apply a patch file to the current document
es_es: Aplica un archivo de revisión al documento actual

source: Apply a patch file to the current project
es_es: Aplica un archivo de revisión al proyecto actual

source: Artistic License 1.0
es_es: Licencia Artistic 1.0

source: Artistic License 2.0
es_es: Licencia Artistic 2.0

source: Author:
es_es: Autor:

source: Autocomplete new subroutines in scripts
es_es: Autocompletar subrutinas nuevas en scripts

source: Autoindent:
es_es: Sangría automática:

source: Blue butterfly on a green leaf
es_es: Mariposa azul sobre una hoja verde

source: Browse
es_es: Examinar

source: Browse...
es_es: Examinar...

source: Builder:
es_es: Generador:

source: Cannot diff if file was never saved
es_es: No es posible determinar las diferencias si el archivo no se ha guardado nunca

source: Case &insensitive
es_es: No distinguir mayúsculas de minúsculas

source: Case Sensitive
es_es: Distinguir mayúsculas de minúsculas

source: Category:
es_es: Categoría:

source: Change font size
es_es: Cambiar tamaño de fuente

source: Change variable style to Using_Underscores
es_es: Cambiar estilo de variable a Usando_Guiones

source: Change variable style to using_underscores
es_es: Cambiar estilo de variable a usando_guiones

source: Change variable to CamelCase
es_es: Cambiar estilo de variable a CamelCase

source: Change variable to camelCase
es_es: Cambiar estilo de variable a camelCase

source: Check for Common (Beginner) Errors
es_es: Detectar errores comunes (de principiante)

source: Check for file updates on disk every (seconds):
es_es: Buscar actualizaciones de archivo en el disco cada (segundos):

source: Choose the default projects directory
es_es: Elija el directorio de proyectos predeterminado

source: Class:
es_es: Clase:

source: Clean Recent Files List
es_es: Borrar lista de archivos recientes

source: Clear Selection Marks
es_es: Borrar marcas de selección

source: Close Files...
es_es: Cerrar archivos...

source: Close Window on Hit
es_es: Cerrar ventana al encontrar coincidencia

source: Close all Files
es_es: Cerrar todos los archivos

source: Close all other Files
es_es: Cerrar los demás archivos

source: Close other Projects
es_es: Cerrar otros proyectos

source: Close this Project
es_es: Cerrar este proyecto

source: Colored text in output window (ANSI)
es_es: Texto coloreado en la ventana de resultados (ANSI):

source: Comment out or remove comment out of selected lines in the document
es_es: Aplica o quita marcas de comentario a las líneas seleccionadas del documento

source: Comment out selected lines in the document
es_es: Aplica marcas de comentario a las líneas seleccionadas del documento

source: Compare the file in the editor to that on the disk and show the diff in the output window
es_es: Compara el archivo del editor con el archivo almacenado en el disco y muestra las diferencias en la ventana de resultados

source: Content type:
es_es: Tipo de contenido:

source: Context Help
es_es: Ayuda contextual

source: Convert Encoding
es_es: Convertir codificación

source: Convert Line Endings
es_es: Convertir caracteres de fin de línea

source: Copy Directory Name
es_es: Copiar nombre de directorio

source: Copy Editor Content
es_es: Copiar contenido del editor

source: Copy Filename
es_es: Copiar nombre de archivo

source: Copy Full Filename
es_es: Copiar nombre de archivo completo

source: Copy Specials
es_es: Copiar especiales

source: Crashed
es_es: Bloqueado

source: Create Project Tagsfile
es_es: Crear archivo de etiquetas de proyecto

source: Created by
es_es: Creado por

source: Creates a Padre Plugin
es_es: Crea un Complemento de Padre

source: Creates a Padre document
es_es: Crea un documento de Padre

source: Creates a Perl 5 module or script
es_es: Crea un módulo o script Perl 5

source: Current Document
es_es: Documento actual

source: Current Document: %s
es_es: Documento actual: %s

source: Current file's basename
es_es: Nombre base del archivo actual

source: Current file's dirname
es_es: Directorio de archivo actual

source: Current filename
es_es: Nombre de archivo actual

source: Current filename relative to project
es_es: Nombre de archivo actual con respecto al proyecto

source: Cursor Blink Rate (milliseconds - 0 = blink off; 500 = default):
es_es: Velocidad de parpadeo del cursor (milisegundos - 0 = parpadeo desactivado; 500 = predeterminada):

source: Decrease Font Size
es_es: Reducir tamaño de fuente

source: Default line ending:
es_es: Fin de línea predeterminado:

source: Default projects directory:
es_es: Directorio de proyectos predeterminado:

source: Delete Leading Spaces
es_es: Eliminar espacios iniciales

source: Delete Trailing Spaces
es_es: Eliminar espacios finales

source: Diff Tools
es_es: Herramientas de comparación

source: Diff to Saved Version
es_es: Comparar con versión guardada

source: Diff tool:
es_es: Herramienta de comparación:

source: Document location:
es_es: Ubicación del documento:

source: Document name:
es_es: Nombre del documento:

source: Dump
es_es: Volcado

source: Dump %INC and @INC
es_es: Volcado de %INC y @INC

source: Dump Current Document
es_es: Volcado de documento actual

source: Dump Current PPI Tree
es_es: Volcado de árbol de PPI actual

source: Dump Display Geometry
es_es: Volcado de geometría de pantalla

source: Dump Expression...
es_es: Volcado de expresión...

source: Dump Task Manager
es_es: Administrador de tareas de volcado

source: Dump Top IDE Object
es_es: Volcado de objeto IDE de nivel superior

source: EOL to Mac Classic
es_es: EOL a Mac Classic

source: EOL to Unix
es_es: EOL a Unix

source: EOL to Windows
es_es: EOL a Windows

source: Edit My Plug-in
es_es: Editar el complemento personalizado

source: Edit the user preferences
es_es: Permite editar las preferencias de usuario

source: Edit with Regex Editor
es_es: Editar con el Editor de expresiones regulares

source: Edit/Add Snippets
es_es: Editar o agregar fragmentos de código

source: Editor Current Line Background Colour:
es_es: Color de fondo de la línea actual:

source: Editor Font:
es_es: Editor de fuentes:

source: Email Address:
es_es: Correo electrónico:

source: Enable bookmarks
es_es: Habilitar marcadores

source: Enable session manager
es_es: Habilitar el administrador de sesiones

source: Enable?
es_es: Habilitar

source: Encode Document to System Default
es_es: Aplicar al documento la codificación predeterminada del sistema

source: Encode Document to utf-8
es_es: Codificar documento como UTF-8

source: Encode Document to...
es_es: Codificar documento como...

source: Error while loading %s
es_es: Error al cargar %s

source: Existing bookmarks:
es_es: Marcadores existentes:

source: Expression
es_es: Expresión

source: External Tools
es_es: Herramientas externas

source: Extract Subroutine...
es_es: Extraer subrutina...

source: Failed to find template file '%s'
es_es: No se encuentra el archivo de plantilla '%s'

source: Field %s was missing.
es_es: Falta el campo %s.

source: Module not created.
es_es: No se ha creado el módulo.

source: File type:
es_es: Tipo de archivo:

source: File...
es_es: Archivo...

source: Files and Colors
es_es: Archivos y colores

source: Filter through External Tool...
es_es: Filtrar mediante herramienta externa...

source: Filter through Perl...
es_es: Filtrar mediante código Perl...

source: Find All
es_es: Buscar todas

source: Find Method Declaration
es_es: Buscar declaración de método

source: Find Next
es_es: Buscar siguiente

source: Find Previous
es_es: Buscar anterior

source: Find Unmatched Brace
es_es: Buscar llave desemparejada

source: Find Variable Declaration
es_es: Buscar declaración de variable

source: Find next matching text using a toolbar-like dialog at the bottom of the editor
es_es: Busca coincidencias mediante un diálogo tipo barra de herramientas en la parte inferior del editor

source: Find previous matching text using a toolbar-like dialog at the bottom of the editor
es_es: Busca la coincidencia anterior mediante un diálogo tipo barra de herramientas en la parte inferior del editor

source: Fold all
es_es: Plegar todo

source: Font Size
es_es: Tamaño de fuente

source: Found %d issue(s)
es_es: Se encontraron %d problema(s)

source: Found %d issue(s) in %s
es_es: Se encontró %d problema(s) en %s

source: GPL 2 or later
es_es: GPL 2 o posterior

source: Go to Bookmark
es_es: Ir a marcador

source: Go to Command Line Window
es_es: Ir a ventana de línea de comandos

source: Go to Functions Window
es_es: Ir a ventana de funciones

source: Go to Main Window
es_es: Ir a ventana principal

source: Go to Outline Window
es_es: Ir a ventana de esquema

source: Go to Output Window
es_es: Ir a ventana de resultados

source: Go to Syntax Check Window
es_es: Ir a ventana de comprobación de sintaxis

source: Go to Todo Window
es_es: Ir a ventana de tareas pendientes

source: Goto
es_es: Ir a

source: Goto previous position
es_es: Ir a la posición anterior

source: Guess
es_es: Detectar

source: Guess from current document:
es_es: Detectar en el documento actual

source: Hide Find in Files
es_es: Esconder Buscar en archivos

source: Hide the list of matches for a Find in Files search
es_es: Esconder la lista de aciertos para una Búsqueda de Ficheros

source: Highlighter:
es_es: Resaltador de sintaxis:

source: Imitate clicking on the right mouse button
es_es: Simula un clic con el botón secundario

source: Increase Font Size
es_es: Aumentar tamaño de fuente

source: Indentation width (in columns):
es_es: Ancho de sangría (en columnas)

source: Indication if current file was modified
es_es: Indicación de si se ha modificado el archivo actual

source: Install CPAN Module
es_es: Instalar módulo de CPAN

source: Install Remote Distribution
es_es: Instalar distribución remota

source: Interpreter arguments:
es_es: Argumentos del intérprete

source: Introduce Temporary Variable...
es_es: Insertar variable temporal...

source: Jump between the two last visited files back and forth
es_es: Saltar entre los dos últimos archivos visitados

source: Jump to the last position saved in memory
es_es: Ir a la última posición guardada en memoria

source: LGPL 2.1 or later
es_es: LGPL 2.1 o posterior

source: Language
es_es: Idioma

source: Last Visited File
es_es: Último archivo visto

source: License:
es_es: Licencia:

source: Live Support
es_es: Soporte en línea

source: Load All Padre Modules
es_es: Cargar todos los módulos de Padre

source: Lock User Interface
es_es: Bloquear interfaz de usuario

source: Lower All
es_es: Convertir todo a minúsculas

source: MIT License
es_es: Licencia MIT

source: Mark Selection End
es_es: Marca fin de selección

source: Mark Selection Start
es_es: Marcar inicio de selección

source: Max. number of suggestions:
es_es: Longitud máx. de sugerencias:

source: Methods order:
es_es: Orden de métodos:

source: Mime type already had a class '%s' when %s(%s) was called
es_es: El tipo MIME ya tenía una clase '%s' cuando se llamó a %s(%s)

source: Mime type did not have a class entry when %s(%s) was called
es_es: El tipo MIME no tenía una entrada de clase cuando se llamó a %s(%s)

source: Mime type is not supported when %s(%s) was called
es_es: No se admitía el tipo MIME cuando se llamó a %s(%s)

source: Mime type was not supported when %s(%s) was called
es_es: No se admitía el tipo MIME cuando se llamó a %s(%s)

source: Min. chars for autocompletion:
es_es: Nº mínimo de caracteres para autocompletar:

source: Min. length of suggestions:
es_es: Longitud mín. de sugerencias:

source: Module
es_es: Módulo

source: Module Name:
es_es: Nombre del módulo:

source: Module Start
es_es: Nuevo módulo

source: Module Tools
es_es: Herramientas para módulos

source: Move POD to __END__
es_es: Trasladar POD hacia __END_

source: Mozilla Public License
es_es: Licencia Pública de Mozilla

source: N/A
es_es: No disponible

source: Name of the current subroutine
es_es: Nombre de la subrutina actual

source: Name:
es_es: Nombre:

source: New
es_es: Nuevo

source: Newline Same Column
es_es: Carácter de nueva línea en la misma columna

source: Next File
es_es: Archivo siguiente

source: No Document
es_es: Ningún documento

source: No Perl 5 file is open
es_es: Ningún archivo de Perl 5 abierto

source: No errors or warnings found in %s.
es_es: No se detectó ningún error o advertencia en %s.

source: No errors or warnings found.
es_es: No se detectó ningún error o advertencia.

source: Not a positive number!
es_es: No es un número positivo.

source: Number of lines
es_es: Número de líneas

source: Oldest Visited File
es_es: Archivo más antiguo visto

source: Open All Recent Files
es_es: Abrir todos los archivos recientes

source: Open CPAN Config File
es_es: Abrir archivo de configuración de CPAN

source: Open Example
es_es: Abrir ejemplo

source: Open Resources...
es_es: Abrir recursos...

source: Open Session...
es_es: Abrir sesión...

source: Open files:
es_es: Archivos abiertos:

source: Open in Command Line
es_es: Abrir en la línea de comandos

source: Open perlmonks.org, one of the biggest Perl community sites, in your default web browser
es_es: Abre perlmonks.org, uno de los sitios principales de la comunidad Perl, en el navegador web predeterminado

source: Open with Default System Editor
es_es: Abrir con el editor predeterminado del sistema

source: Open...
es_es: Abrir...

source: Opens the Padre document wizard
es_es: Abre el asistente para documentos de Padre

source: Opens the Padre plugin wizard
es_es: Abre el asistente para complementos de Padre

source: Opens the Perl 5 module wizard
es_es: Abre el asistente para módulos Perl 5

source: Out of range!
es_es: Fuera del intervalo

source: Padre Document Wizard
es_es: Asistente de Documento de Padre

source: Padre Plugin Wizard
es_es: Asistente de complementos de Padre

source: Padre Support (English)
es_es: Soporte técnico de Padre (en inglés)

source: Padre is free software; you can redistribute it and/or modify it under the same terms as Perl 5.
es_es: Padre es software libre; puede redistribuirlo o modificarlo bajo los mismos términos que Perl 5.

source: Padre version
es_es: Versión de Padre

source: Parent Directory:
es_es: Directorio principal:
